OF_Sims/planar_Sims/planarPoiseuille_2dT/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss linearUpwind grad(U);
    div(phi,sigma)  Gauss vanAlbada;
    div(phiv,p)     Gauss limitedLinear 1;
    div(sigma)                  Gauss linear;
    div((nu*dev2(T(grad(U)))))  Gauss linear;
    div((nuM*grad(U)))          Gauss linear;
    div((rhol_kg*(phi|interpolate(rho))),N)  Gauss limitedLinear 1;
    div(phi,M)      Gauss limitedLinear 1;
    div((phi*interpolate(M)),U) Gauss limitedLinear 1;
    div((phi*interpolate(M)),he) Gauss limitedLinear 1;
    div((phi*interpolate(M)),K) Gauss limitedLinear 1;
    div((phi*interpolate(M)),e) Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,K) Gauss limitedLinear 1;
    div(phi,e) Gauss limitedLinear 1;
    div(phi,N) Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}

// ************************************************************************* //
